app/Http/Controllers/FasilitasHotelController.php

SELECT * FROM `fasilitas_hotels`
---
    public function index()
    {
        return view('admin.fasilitasHotel', [
            'fasilitas_hotels' => FasilitasHotel::all()
        ]);