app/Http/Controllers/FasilitasKamarController.php

    public function index()
    {
        return view('admin.kelola_fasilitas_kamar', [
            'fasilitas_kamars' => FasilitasKamar::with('kamar')->get(),
            'kamars' => Kamar::all()
        ]);
---
SELECT * FROM `fasilitas_kamars`
SELECT * FROM `kamars` WHERE `kamars`.`id` in (1, 2)
SELECT * FROM `kamars`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'kamar_id' => 'required',
            'nama_fasilitas' => 'required'
        ]);

        FasilitasKamar::create($validatedData);
---
INSERT INTO `fasilitas_kamars` (`kamar_id`, `nama_fasilitas`, `updated_at`, `created_at`) VALUES ('1', 'KUJAN', '2022-05-16 05:34:18', '2022-05-16 05:34:18')

    public function destroy(FasilitasKamar $kelola_fasilitas_kamar)
    {
        FasilitasKamar::destroy($kelola_fasilitas_kamar->id);
---
DELETE FROM `fasilitas_kamars` WHERE `id` = 6