app/Http/Controllers/KamarController.php

SELECT * FROM `kamars`
---
    public function index()
    {
        return view('admin.kelola_kamar', [
            'kamar' => Kamar::all()
        ]);

INSERT INTO `kamars` (`tipe_kamar`, `jumlah_kamar`, `image`, `updated_at`, `created_at`) VALUES ('anjay', '123', 'kamar-images/BPkQPrMGOmdaSw7qQ3ZFMStE55G7aUvPyXGs5US0.jpg', '2022-05-16 05:30:20', '2022-05-16 05:30:20')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'tipe_kamar' => 'required',
            'jumlah_kamar' => 'required|numeric',
            'image' => 'required|image|file|max:5000'
        ]);

        $validatedData['image'] = $request->file('image')->store('kamar-images');

        Kamar::create($validatedData);

DELETE FROM `kamars` WHERE `id` = 5
SELECT * FROM `kamars` WHERE `id` in (5)
---
    public function update(Request $request, Kamar $kelola_kamar)
    {
        $validatedData = $request->validate([
            'tipe_kamar' => 'required',
            'jumlah_kamar' => 'required|numeric',
            'image' => 'required|image|file|max:5000'
        ]);

        Storage::delete($kelola_kamar->image);
        $validatedData['image'] = $request->file('image')->store('kamar-images');

        Kamar::find($kelola_kamar->id)
                    ->update($validatedData);