app/Http/Controllers/LoginController.php

SELECT * FROM `users` WHERE `id` = 1 LIMIT 1
---
    public function authenticate(Request $request)
    {
        $credentials = $request->validate([
            'email' => 'required|email:dns',
            'password' => 'required'
        ]);

        if(Auth::attempt($credentials)) {
            $request->session()->regenerate();

            $user = User::find(auth()->user()->id);

            if($user->hasRole('tamu')) {
                return redirect()->intended('/')->with('success', 'Anda berhasil login! Selamat datang kembali ' . auth()->user()->name);
            } else if($user->hasRole('resepsionis')) {
                return redirect()->intended('/resepsionis')->with('success', 'Anda berhasil login! Selamat datang kembali ' . auth()->user()->name);
            } else if($user->hasRole('admin')) {
                return redirect()->intended('/kelola_kamar')->with('success', 'Anda berhasil login! Selamat datang kembali ' . auth()->user()->name);