app/Http/Controllers/PageController.php

SELECT * FROM `kamars`
---
    public function kamar()
    {
        return view('kamar', [
            'title' => 'Kamar',
            'kamars' => Kamar::with('fasilitas')->get()

SELECT * FROM `fasilitas_hotels`
---
    public function Fasilitas()
    {
        return view('fasilitas', [
            'title' => 'Fasilitas',
            'fasilitas' => FasilitasHotel::all()